# DuctPressureDropCalculatorNotAvailable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..DuctPressureDropCalculatorNotAvailable Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
Duct Pressure Drop Calculator Not Available: [Calculator Name]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuctPressureDropCalculatorNotAvailable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctPressureDropCalculatorNotAvailable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuctPressureDropCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace